#include<stdio.h>
#include<stdlib.h>
#include<stdlib.h>
#include<conio.h>
#include<malloc.h>
#include<time.h>
#include <ctype.h>
#include<string.h>
#include <windows.h>
#include "room.h"
#include "common.h"
#include "quanjv.h"
//#include"function4.0.c"
//#include "guest_functions.c"
/*void gst_menu();
void show_gst_menu();
void select4_2();
void select4_1();
void setting();
void Rgrade();
void Rsucceed();
void Rpass();
void RoomMessage(struct room *head);
struct room * select1_5(struct room *head);
struct room * select1_4(struct room *head);
struct room * select1_4_1(struct room *head);
struct room * select1_4_2(struct room *head);
struct room * select1_4_3(struct room *head);
struct room * select1_3(struct room *head);
struct room * select1_2(struct room *head);
struct room * select1_1(struct room *head);
struct room * select1_1_2(struct room *head);
struct room * select1_1_1(struct room *head);*/
void menus()
 {
     system("mode con cols=80 lines=25");
     ppp=0;
     int select;
     struct room *head;
     head = creat();
     fflush(stdin);
     printf("\n\n\t                  酒店预订信息管理查询系统\n");
     printf("\t------------------------------------------------------------\n");
     printf("\n\t************************************************************\n");
     printf("\t*             欢迎使用酒店预订信息管理查询系统             *\n");
     printf("\t*  本系统用于酒店客房信息管理和客人预订及入住信息管理      *\n");
     printf("\t*  本系统也对酒店客房信息和客人预订及入住信息有统计功能    *\n");
     printf("\t************************************************************\n");
     printf("\t============================================================\n");
     printf("\t||                   请选择您所需要的功能                 ||\n");
     printf("\t||              ****************************              ||\n");
     printf("\t||              * 1 酒店客房信息管理       *              ||\n");
     printf("\t||              * 2 客人预订及入住信息管理 *              ||\n");
     printf("\t||              * 3 酒店信息统计           *              ||\n");
     printf("\t||              * 4 设置                   *              ||\n");
     printf("\t||              * 0 退出                   *              ||\n");
     printf("\t||              ****************************              ||\n");
     printf("\t============================================================\n");
     printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");

     select=getch();
     switch(select)
     {
     case '1':
     system("cls");
     RoomMessage(head);//进入酒店客房信息管理
     break;
     case '2':system("cls");gst_menu();
     //kerenyuding();

     break;
     case '3':system("cls");Roomstat(head);
     break;
     case '4':system("cls");setting();
     break;
     case '0': exit(0);
     default:system("cls");Rgrade(); getch();system("cls");menus();
    }

}

 void Roomstat(struct room *head)
{
    FREE(head);
    system("mode con cols=80 lines=25");
     ppp=0;
    system("cls");
    head = creat();
    int select;
    printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||             欢迎使用酒店客房信息管理系统               ||\n"
            "\t||      请选择                                            ||\n"
            "\t||      1 客房信息统计                                    ||\n"
            "\t||      2 客人信息统计                                    ||\n"
            "\t||      3 返回上一级                                      ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
    select=getch();
    switch(select)
    {
        case '1': system("cls");stat_mon(head);break;
        case '2': system("cls"); counting_gst(head);break;
        case '3': system("cls");menus();break;
        default:system("cls");Rgrade(); getch();system("cls");Roomstat(head);
    }


}
void RoomMessage(struct room *head)
{
    FREE(head);
    system("mode con cols=80 lines=25");
     ppp=0;
    system("cls");
    head = creat();
    int select;
    printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||             欢迎使用酒店客房信息管理系统               ||\n"
            "\t||      请选择                                            ||\n"
            "\t||      1 查看所有客房                                    ||\n"
            "\t||      2 添加新客房                                      ||\n"
            "\t||      3 删除客房                                        ||\n"
            "\t||      4 修改房间                                        ||\n"
            "\t||      5 查询历史记录                                    ||\n"
            "\t||      6 返回上一级                                      ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
    select=getch();
    switch(select)
    {
        case '1': system("cls");select1_1(head);break;
        case '2': system("cls");select1_2(head);break;
        case '3': system("cls");select1_3(head);break;
        case '4': system("cls");select1_4(head);break;
        case '5': system("cls");select1_5(head);break;
        case '6': system("cls");menus();break;
        default:system("cls");Rgrade(); getch();system("cls");RoomMessage(head);
    }

}
struct room * select1_5(struct room *head)
{   system("mode con cols=80 lines=45");
    char h[50][50];
    int i;

     printf("\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||         请输入需要查看的历史记录编号(最近30条)：       ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n");

    //printf("请输入需要查看的历史记录编号：\n");
    //printf("请输入需要查看的历史记录编号(最近30条):\n");
     i =search_his(h);gotoxy(37,5);
    int id = judge(i-30,i-1);
    system("cls");
    if (id<0) {system("cls");Rgrade(); getch();system("cls");RoomMessage(head);}
    system("mode con cols=120 lines=55");    system("cls");
    head=creat_his(h[id]);
    serch(head,0);
     printf("\t\t\t************************************************************\n"
            "\t\t\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t\t\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t\t\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t\t\t************************************************************\n"
            "\t\t\t------------------------------------------------------------\n"
            "\t\t\t************************************************************\n"
            "\t\t\t||                                                        ||\n"
            "\t\t\t||                 请选择                                 ||\n"
            "\t\t\t||      1.恢复历史记录                                    ||\n"
            "\t\t\t||     (会导致历史时间之后的客房预订信息失效)             ||\n"
            "\t\t\t||      2. 清空所有历史记录（保存清空时的信息）           ||\n"
            "\t\t\t||      3. 返回上一级                                     ||\n"
            "\t\t\t------------------------------------------------------------\n"
            "\t\t\t************************************************************\n"
            "\t\t\t************************************************************\n"
            "\t\t\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t\t\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t\t\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t\t\t************************************************************\n");
    //printf("\t1.恢复历史记录（警告：恢复历史记录会导致历史时间之后的客房预订信息失效）\n\t2.返回上一级菜单\n");
    int s=getch();
    system("cls");
    if (s=='1') {system("cls");if (pass()>0) {save(head);
    Rsucceed();
    getch();system("cls");RoomMessage(head);}
                    else {Rpass();getch();system("cls");RoomMessage(head);}}
    if (s=='2'){system("cls");if (pass()>0) {
                 FILE *fp;
        if((fp=fopen("time.dat","w")) == NULL)
       {
           printf("can not open this file3\n");
           exit(0);
       }
       fclose(fp);
    FREE(head);head=creat();save_his(head);
    Rsucceed();
    getch();system("cls");RoomMessage(head);}
                    else {Rpass();getch();system("cls");RoomMessage(head);}}
    else if (s=='3' ){system("cls");RoomMessage(head);}
    else {Rgrade();getch();system("cls");RoomMessage(head);}
    system("cls");RoomMessage(head);
}
struct room * select1_4_3(struct room *head)
{   system("mode con cols=80 lines=25");
    int id;
    printf("\n\n\n\n\n\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                     请输入修改房间：                   ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n");
            gotoxy(37,10);
    id = judge(1,num);
    if (id<0) {system("cls");Rgrade(); getch();system("cls");select1_4(head);}
   system("cls");
    printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                请输入需要修改的内容                    ||\n"
            "\t||                1.修改价格                              ||\n"
            "\t||                2.修改类型                              ||\n"
            "\t||                3.修改设施服务                          ||\n"
            "\t||                4.返回上一级                            ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
    int op;op=judge(1,4);system("cls");
    if(op<0) {system("cls");Rgrade(); getch();system("cls");select1_4(head);}
     int right;
    switch(op)
        {
            case 1: //printf("请输入新的价格(价格范围为1-%d)\n",MAX);
             printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||               请输入新的价格(价格范围为1-%d)        ||\n",MAX);
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
                    int r;r = judge(1,MAX);
                    system("cls");
                    if (r<0){system("cls");Rgrade(); getch();system("cls");select1_4(head);}
                     right =chage(head,id,0,r,0);if (right==0){
                    Rsucceed(); save(head);getch();system("cls");select1_4(head);break;}
                    else{ printf("\n\n\n\n\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t    *    *     *     *     *    *    *     *     *     *    \n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t************************************************************\n"
            "\t *     *      *            对不起            *       *    *  \n"
            "\t    *      *     *       当前无房间       *     *      *     \n"
            "\t *     * *         *   请按任意键返回   *          * *    *   \n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");getch();system("cls");select1_4(head);break;}break;
            case 2: //printf("请输入将房间修改的类型(0-大床房 1-单人房 2-双人房 3-豪华大床 4-豪华双人 5-多床房 6-钟点房)\n");
                printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                  请输入将房间修改的类型                ||\n"
            "\t||                  0.大床房                              ||\n"
            "\t||                  1.单人房                              ||\n"
            "\t||                  2.双人房                              ||\n"
            "\t||                  3.豪华大床                            ||\n"
            "\t||                  4.豪华双人                            ||\n"
            "\t||                  5.多床房                              ||\n"
            "\t||                  6.钟点房                              ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
                    int type =judge(0,6);
                    system("cls");
                    if (type<0){system("cls");Rgrade(); getch();system("cls");select1_4(head);}
                    right = chage(head,id,1,1,type);if (right==0){
                    Rsucceed(); save(head);getch();system("cls");select1_4(head);break;}
                    else{printf("房间不存在\n");getch();system("cls");select1_4(head);break;}break;
            case 3://printf("请输入需要更改的服务设施\n1.改为有wifi和宽带\n2.改为无wifi和宽带\n3.改为有早餐\n4.改为无早餐\n5.改为有独卫\n6.改为无独卫\n");
                printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                  请输入需要更改的服务设施              ||\n"
            "\t||                  1.改为有wifi和宽带                    ||\n"
            "\t||                  2.改为无wifi和宽带                    ||\n"
            "\t||                  3.改为有早餐                          ||\n"
            "\t||                  4.改为无早餐                          ||\n"
            "\t||                  5.改为有独卫                          ||\n"
            "\t||                  6.改为无独卫                          ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
            gotoxy(33,15);
                    int opt=judge(1,6);
                    system("cls");
                    if (opt<0){system("cls");Rgrade(); getch();system("cls");select1_4(head);}
                    switch(opt)
                    {
                        case 1:right=chage(head,id,2,1,0);break;
                        case 2:right=chage(head,id,2,1,1);break;
                        case 3:right=chage(head,id,3,1,0);break;
                        case 4:right=chage(head,id,3,1,1);break;
                        case 5:right=chage(head,id,4,1,0);break;
                        case 6:right=chage(head,id,4,1,1);break;
                    }
                    if (right==0){
                    Rsucceed(); save(head);getch();system("cls");select1_4(head);break;}
                    else{ printf("\n\n\n\n\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t    *    *     *     *     *    *    *     *     *     *    \n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t************************************************************\n"
            "\t *     *      *            对不起            *       *    *  \n"
            "\t    *      *     *       当前无房间       *     *      *     \n"
            "\t *     * *         *   请按任意键返回   *          * *    *   \n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");;getch();system("cls");select1_4(head);break;}break;
            case 4:system("cls");select1_4(head);break;
                        }
        return head;

}


struct room * select1_4_2(struct room *head)
{
    system("mode con cols=80 lines=25");
    int type;
   // printf("请输入修改房间的类型(0-大床房 1-单人房 2-双人房 3-豪华大床 4-豪华双人 5-多床房 6-钟点房)\n");
    printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                  请输入将房间修改的类型                ||\n"
            "\t||                  0.大床房                              ||\n"
            "\t||                  1.单人房                              ||\n"
            "\t||                  2.双人房                              ||\n"
            "\t||                  3.豪华大床                            ||\n"
            "\t||                  4.豪华双人                            ||\n"
            "\t||                  5.多床房                              ||\n"
            "\t||                  6.钟点房                              ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
    //printf("如无需修改请按其他键返回上一级\n");
    type = judge(0,6);
    system("cls");
    if (type<0) {system("cls");Rgrade(); getch();system("cls");select1_4(head);}
   // printf("请输入价格变化幅度（例如\"50\"代表所有房间价格*50%%）\n范围为10-1000，超过价格区间的房间修改无效\n");
    printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||   请输入价格变化幅度例如\"50\"代表所有房间价格*50%%）     ||\n");
         printf("\t||       范围为10-1000，超过价格区间的房间修改无效        ||\n");
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
    int r;r = judge(10,1000);
    if (r<0){system("cls");Rgrade(); getch();system("cls");select1_4(head);}
    Type_chage(head,type,r);
    system("cls");
    Rsucceed();save(head); getch();system("cls");
    select1_4(head);
    return head;
}
struct room * select1_4_1(struct room *head)
{system("mode con cols=80 lines=25");
   // printf("请输入价格变化幅度（例如\"50\"代表所有房间价格*50%%）\n范围为10-1000，超过价格区间的房间修改无效\n");
     printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||   请输入价格变化幅度例如\"50\"代表所有房间价格*50%%）     ||\n");
         printf("\t||       范围为10-1000，超过价格区间的房间修改无效        ||\n");
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
    int r;r = judge(10,1000);
    system("cls");
    if (r<0){system("cls");Rgrade();getch();system("cls");select1_4(head);}
    All_chage(head,r);system("cls");
   Rsucceed();save(head);getch();system("cls");
    select1_4(head);
    return head;
}
struct room * select1_4(struct room *head)
{
if (pass()<0) {  system("cls");Rpass(); getch();system("cls");RoomMessage(head);}
    ppp = 1;
    system("mode con cols=120 lines=80");
  serch(head,0);
   printf("\t\t\t************************************************************\n"
            "\t\t\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t\t\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t\t\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t\t\t************************************************************\n"
            "\t\t\t------------------------------------------------------------\n"
            "\t\t\t************************************************************\n"
            "\t\t\t||                请输入需要修改的类型                    ||\n"
            "\t\t\t||                1.修改全部房间价格                      ||\n"
            "\t\t\t||                2.修改特定类型房间价格                  ||\n"
            "\t\t\t||                3.修改特定房间                          ||\n"
            "\t\t\t||                4.返回上一级                            ||\n"
            "\t\t\t************************************************************\n"
            "\t\t\t------------------------------------------------------------\n"
            "\t\t\t************************************************************\n"
            "\t\t\t************************************************************\n"
            "\t\t\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t\t\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t\t\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t\t\t************************************************************\n");
  //printf("请输入需要修改的类型：\n1.修改全部房间价格\n2.修改特定类型房间价格\n3.修改特定房间\n4.返回上一级\n");
  int s;s = getch();
   switch(s)
  {
      case '1':system("cls");select1_4_1(head);break;
      case '2':system("cls");select1_4_2(head);break;
      case '3':system("cls");select1_4_3(head);break;
      case '4':system("cls");RoomMessage(head);break;
      default:{system("cls");Rgrade(); getch();system("cls");RoomMessage(head);}
  }
}
struct room * select1_3(struct room *head)
{   system("cls");
    if (pass()<0) {  system("cls");Rpass(); getch();system("cls");RoomMessage(head);}
    ppp=1;
    system("mode con cols=125 lines=80");
    serch(head,0);
    printf("\t\t\t------------------------------------------------------------\n"
                "\t\t\t************************************************************\n"
                "\t\t\t||                                                        ||\n"
                "\t\t\t||                请输入需要删除的房间ID                  ||\n");
         printf("\t\t\t||                                                        ||\n");
         printf("\t\t\t||                                                        ||\n"
                "\t\t\t||                                                        ||\n"
                "\t\t\t||                                                        ||\n"
                "\t\t\t************************************************************\n"
                "\t\t\t------------------------------------------------------------\n");
                HANDLE hConsole = GetStdHandle(STD_OUTPUT_HANDLE);
                CONSOLE_SCREEN_BUFFER_INFO csbi;
                GetConsoleScreenBufferInfo(hConsole, &csbi);
                gotoxy(53,csbi.dwCursorPosition.Y-4);
    int id;id=judge(1,num);
    system("cls");
    if (id<0) {system("cls");Rgrade(); getch();system("cls");RoomMessage(head);}
    head=del_room(head,id);
    if (head==NULL&&n!=0){ getch();system("cls");RoomMessage(head);}
    save(head);
    system("mode con cols=80 lines=25");
         printf("\n\n\n\n\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t    *    *     *     *     *    *    *     *     *     *    \n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t************************************************************\n"
            "\t *     *      *            恭喜您            *       *    *  \n"
            "\t    *      *     *        删除成功        *     *      *     \n"
            "\t *     * *         *   请按任意键返回   *          * *    *   \n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
        //printf("删除成功请按任意键返回\n");
        getch();
        system("cls");
        RoomMessage(head);
        return head;
}
struct room * select1_2(struct room *head)
{system("mode con cols=80 lines=25");
    system("cls");
    int option;
    if (pass()<0) {  system("cls");Rpass(); getch();system("cls");RoomMessage(head);}
    ppp= 1;
    int type,price,wifi,breakfast,wc,floor;
    printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                  请输入新建房间类型                    ||\n"
            "\t||                  0.大床房                              ||\n"
            "\t||                  1.单人房                              ||\n"
            "\t||                  2.双人房                              ||\n"
            "\t||                  3.豪华大床                            ||\n"
            "\t||                  4.豪华双人                            ||\n"
            "\t||                  5.多床房                              ||\n"
            "\t||                  6.钟点房                              ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
    //printf("请输入新建房间类型(0-大床房 1-单人房 2-双人房 3-豪华大床 4-豪华双人 5-多床房 6-钟点房)\n");
    //printf("    *********************如不需新建请按其他键键返回*********************\n");
    type = judge(0,6);
    system("cls");
    while  (type<0) { system("cls");Rgrade2(); option=getch();if(option=='#'){system("cls");RoomMessage(head);}else  {
            system("mode con cols=80 lines=25");
            system("cls");
            printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                  请输入新建房间类型                    ||\n"
            "\t||                  0.大床房                              ||\n"
            "\t||                  1.单人房                              ||\n"
            "\t||                  2.双人房                              ||\n"
            "\t||                  3.豪华大床                            ||\n"
            "\t||                  4.豪华双人                            ||\n"
            "\t||                  5.多床房                              ||\n"
            "\t||                  6.钟点房                              ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");type = judge(0,6);}}
            system("cls");
     printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||      请输入新建房间价格(范围1-%d元 单位:人民币)     ||\n",MAX);
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
    //if (type<0) {  system("cls");Rgrade(); getch();system("cls");RoomMessage(head);}
   // printf("请输入新建房间价格(范围1-%d元 单位:人民币)\n",MAX);
    price = judge(1,MAX);
    system("cls");
    while (price<0) { system("cls");Rgrade2(); option=getch();if(option=='#'){system("cls");RoomMessage(head);}else{system("cls");


            printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||      请输入新建房间价格(范围1-%d元 单位:人民币)     ||\n",MAX);
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
    //if (type<0) {  system("cls");Rgrade(); getch();system("cls");RoomMessage(head);}
   // printf("请输入新建房间价格(范围1-%d元 单位:人民币)\n",MAX);
    price = judge(1,MAX);
    system("cls");
        }}
        system("cls");
     printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||         请输入新建房间门牌号(所有门牌号100-999)        ||\n");
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
   // printf("请输入新建房间门牌号(所有门牌号100-999)\n");
    floor = judge(100,999);
    system("cls");
    while  (floor<0||f[floor]==1) { system("cls");Rgrade3(); option=getch();if(option=='#'){system("cls");RoomMessage(head);}else{system("cls");
         printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||         请输入新建房间门牌号(所有门牌号100-999)        ||\n");
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
   // printf("请输入新建房间门牌号(所有门牌号100-999)\n");
    floor = judge(100,999);}}
            system("cls");

     printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||         请输入新建房间有无wifi及宽带(0有 1无)          ||\n");
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
    //printf("请输入新建房间有无wifi及宽带(0有 1无)\n");
    wifi = judge(0,1);
    system("cls");
    //printf("%d\n",wifi);
    while(wifi<0) { system("cls");Rgrade2(); option=getch();if(option=='#'){system("cls");RoomMessage(head);}else{system("cls");
         system("cls");

     printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||         请输入新建房间有无wifi及宽带(0有 1无)          ||\n");
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
    //printf("请输入新建房间有无wifi及宽带(0有 1无)\n");
    wifi = judge(0,1);
    system("cls");}}
        system("cls");
    printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||         请输入新建房间有无早餐(0有 1无)                ||\n");
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
    //printf("请输入新建房间有无早餐(0有 1无)\n");
    breakfast = judge(0,1);
    system("cls");
    while  (breakfast<0){ system("cls");Rgrade2(); option=getch();if(option=='#'){system("cls");RoomMessage(head);}else{system("cls");
          system("cls");
    printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||         请输入新建房间有无早餐(0有 1无)                ||\n");
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
    //printf("请输入新建房间有无早餐(0有 1无)\n");
    breakfast = judge(0,1); system("cls");}}
     system("cls");
     printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||         请输入新建房间有无独卫(0有 1无)                ||\n");
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
    //printf("请输入新建房间有无独卫(0有 1无)\n");
    wc = judge(0,1);
    system("cls");
    while (wc<0) { system("cls");Rgrade2(); option=getch();if(option=='#'){system("cls");RoomMessage(head);}else{system("cls");

     system("cls");
     printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||         请输入新建房间有无独卫(0有 1无)                ||\n");
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
    //printf("请输入新建房间有无独卫(0有 1无)\n");
    wc = judge(0,1);
    system("cls");}}
    head = creat_room(head,type,price,wifi,breakfast,wc,floor);
    save(head);
    getch();
    system("cls");
    RoomMessage(head);
    return head;
}
struct room * select1_1(struct room *head)
{
    system("cls");
    system("mode con cols=120 lines=60");
    serch(head,0);
    printf("\t\t\t************************************************************\n"
            "\t\t\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t\t\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t\t\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t\t\t************************************************************\n"
            "\t\t\t------------------------------------------------------------\n"
            "\t\t\t************************************************************\n"
            "\t\t\t||                                                        ||\n"
            "\t\t\t||                 请选择您所需要的服务                   ||\n"
            "\t\t\t||                  1.筛选房间                            ||\n"
            "\t\t\t||                  2.排序房间                            ||\n"
            "\t\t\t||                  3.返回上一级                          ||\n"
            "\t\t\t||                                                        ||\n"
            "\t\t\t************************************************************\n"
            "\t\t\t------------------------------------------------------------\n"
            "\t\t\t************************************************************\n"
            "\t\t\t************************************************************\n"
            "\t\t\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t\t\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t\t\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t\t\t************************************************************\n");

    /*printf("\t请选择\n");
    printf("\t1.筛选房间\n");
    printf("\t2.排序房间\n");
    printf("\t3.返回上一级\n");*/
    int select;
    select=getch();
    switch(select)
    {
    case '1':system("cls");select1_1_1(head);break;
    case '2':system("cls");select1_1_2(head);break;
    case '3':system("cls");head = creat();RoomMessage(head);break;
    default:
    system("cls");
    Rgrade();
    head = creat();
    getch();system("cls");
    RoomMessage(head);
     break;
    }
}
struct room * select1_1_2(struct room *head)
{system("mode con cols=80lines=25");
    int s;
    //printf("请选择排序方式:\n\t0.按价格从小到大排序\n\t1.按价格从大到小排序\n\t2.按编号从小到大排序\n\t3.按编号从大到小排序\n\t4.无需排序返回上一级\n");
    printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                  请选择排序方式                        ||\n"
            "\t||                  0.按价格从小到大排序                  ||\n"
            "\t||                  1.按价格从大到小排序                  ||\n"
            "\t||                  2.按编号从小到大排序                  ||\n"
            "\t||                  3.按编号从大到小排序                  ||\n"
            "\t||                  4.返回上一级                          ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
    s =getch();
    system("cls");
    switch (s)
    {
        case '0':
        case '1':
        case '2':
        case '3':head = sort(head,s-48);select1_1(head);break;
        case '4': system("cls");select1_1(head);
        default:                  system("cls");
                                  Rgrade();
                                   getch();
                                   system("cls"); head = creat();
                                   select1_1(head);
    }
    return head;
}
struct room * select1_1_1(struct room *head)
{system("mode con cols=80 lines=25");
    int s;
    printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                  请选择您需要筛选的内容                ||\n"
            "\t||                  1.价格                                ||\n"
            "\t||                  2.房型                                ||\n"
            "\t||                  3.设施服务                            ||\n"
            "\t||                  4.空余情况                            ||\n"
            "\t||                  5.返回上一级菜单                      ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
    //printf("\t请选择您需要筛选的内容:\n\t1.价格\n\t2.房型\n\t3.设施服务\n\t4.空余情况\n\t5.返回上一级菜单\n");
    s =getch();system("cls");

    switch (s)
    {
        case '1': {
            printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||           请输入最低价(价格区间：1-%d)：            ||\n",MAX);
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
                //printf("\t请输入最低价(价格区间：1-%d)：\n",MAX);
                int min,max;

                min = judge(1,MAX);
                system("cls");
                printf("\n\n\n\n\t------------------------------------------------------------\n"
                "\t************************************************************\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n");
         printf("\t||           请输入最高价(价格区间：1-%d)：            ||\n",MAX);
         printf("\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t||                                                        ||\n"
                "\t************************************************************\n"
                "\t------------------------------------------------------------\n");
                gotoxy(33,10);
                //printf("\t请输入最高价(价格区间：1-%d)：\n",MAX);
                max = judge(1,MAX);
                if (min<0||max<0||min>max)
                    {
                                system("cls");
                                Rgrade();
                                getch();
                                system("cls"); head = creat();
                                select1_1(head);
                    }
                    head=choose(head,2,min,max);
                    select1_1(head);
                    break;
                }



        case '2':
            printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                  请选择您需要筛选的内容                ||\n"
            "\t||                  0.大床房                              ||\n"
            "\t||                  1.单人房                              ||\n"
            "\t||                  2.双人房                              ||\n"
            "\t||                  3.豪华大床                            ||\n"
            "\t||                  4.豪华双人                            ||\n"
            "\t||                  5.多床房                              ||\n"
            "\t||                  6.钟点房                              ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
             //printf("请输入需要选择的房型:\n(0-大床房 1-单人房 2-双人房 3-豪华大床 4-豪华双人 5-多床房)\n");
                 s=judge(0,6);
                system("cls");
                if (s<0)
                    {
                                system("cls");
                               Rgrade();
                                getch();
                                system("cls"); head = creat();
                                select1_1(head);
                    }
                else
                {
                    head=choose(head,4+s,0,0);select1_1(head);
                }break;

        case '3':
             printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                  请输入你需要的设施服务                ||\n"
            "\t||                  0.有WiFi及宽带                        ||\n"
            "\t||                  1.有早餐                              ||\n"
            "\t||                  2.有独卫                              ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
            //printf("请输入你需要的设施服务\n 0-有WiFi及宽带 1-有早餐 2-有独卫\n");
                int s; s=judge(0,2);
                if (s<0)
                    {
                                system("cls");
                               Rgrade();
                                getch();
                                system("cls"); head = creat();
                                select1_1(head);
                    }
                else
                {
                    head=choose(head,11+s,0,0);select1_1(head);
                }break;
       case '4' : {
                char a[10],b[10];int in,out;
        printf("\n\n\n\n\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||             请输入入住时间(例如20180303)               ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n");
            gotoxy(33,10);
//printf("请输入入住时间(例如20180303)\n");
                in= judge(0,30000000);
                system("cls");
                //printf("请输入离店时间(例如20180303)\n");
                printf("\n\n\n\n\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||             请输入离店时间(例如20180303)               ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n");
            gotoxy(33,10);
                out= judge(0,30000000); system("cls");
                if (in<0||out<0||in>=out)
                    {
                                system("cls");
                               Rgrade();
                                getch();
                                system("cls"); head = creat();
                                select1_1(head);
                    }
                 if (in<20180101||out>20181231)
                 {printf("\n\n\n\n\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t    *    *     *     *     *    *    *     *     *     *    \n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t************************************************************\n"
            "\t *     *      *            对不起            *      *    *  \n"
            "\t    *      *     *       当前无结果       *     *      *     \n"
            "\t *     * *         *   请按任意键返回   *         * *    *   \n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
                        getch();
                        system("cls"); head = creat();
                        select1_1(head);
                 }
                    numtoc(in,a);
                    numtoc(out,b);
                    head=find_freeroom (head,a,b);
                    select1_1(head);
                }break;
        case '5':system("cls"); head = creat();
                                select1_1(head);

        default:
                                system("cls");
                                Rgrade();
                                getch();
                                system("cls"); head = creat();
                                select1_1(head);
    }
     return head;
}
 void setting()
{
    system("cls");
    int select;
    printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                        设置                            ||\n"
            "\t||      请选择                                            ||\n"
            "\t||      1 更改密码                                        ||\n"
            "\t||      2 更改背景色                                      ||\n"
            "\t||      3 程序初始化                                      ||\n"
            "\t||      4 返回上一级                                      ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
    select=getch();
    switch(select)
    {
        case '1': system("cls");select4_1();break;
        case '2': system("cls");select4_2();break;
        case '3': system("cls");select4_3();break;
        case '4': system("cls");menus();break;
        default:system("cls");Rgrade(); getch();system("cls");menus();
    }

}
void select4_3()
{
    if ( pass()<0 ){system("cls"); Rpass(); getch();system("cls");setting();}
    FILE *fb;
    if((fb = fopen("date.dat","w+"))==NULL)
    {
        printf("无法打开文件\n");
        exit(0);
    }
    fprintf(fb,"0,0,0\n");
    fclose(fb);
    if((fb = fopen("id.dat","w+"))==NULL)
    {
        printf("打开文件错误\n");
        exit (0);
    }

        fprintf(fb,"%d\n",0);
        fprintf(fb,"%s\n","000000");
        fprintf(fb,"%d\n",50);
        fclose(fb);
          if((fb = fopen("guest.dat","w+"))==NULL)
    {
        printf("无法打开文件\n");
        exit(0);
    } fclose(fb);
        set_back(50);
        system("cls");
        printf("\n\n\n\n\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t    *    *     *     *     *    *    *     *     *     *    \n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t************************************************************\n"
            "\t *     *      *            恭喜您            *       *    *  \n"
            "\t    *      *     *       初始化成功！     *     *      *     \n"
            "\t *     * *         *   请按任意键返回   *          * *    *   \n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
        //printf("初始化成功！\n\t按任意键返回\n");
        getch();system("cls");setting();
}
void select4_1()
{
    int i = new_pass();
    if (i==0) {system("cls");
    printf("\n\n\n\n\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t    *    *     *     *     *    *    *     *     *     *    \n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t************************************************************\n"
            "\t *     *      *                              *       *    *  \n"
            "\t    *      *     *     请按任意键返回     *     *      *     \n"
            "\t *     * *         *                    *          * *    *   \n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"); getch();system("cls");setting();}
    else if (i==1) {system("cls");Rsucceed(); getch();system("cls");setting();}
    else if (i<0) {system("cls");Rpass(); getch();system("cls");setting();}
}
void select4_2()
{ printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                  请输入背景色                          ||\n"
            "\t||            0.黑色               5.紫色                 ||\n"
            "\t||            1.蓝色               6.黄色                 ||\n"
            "\t||            2.绿色               7.白色                 ||\n"
            "\t||            3.湖蓝色             8.灰色                 ||\n"
            "\t||            4.红色               9.淡蓝色               ||\n"
            "\t||            4.紫色                                      ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
    //printf("请输入背景色  0-黑色  1-蓝色 2-绿色 3-湖蓝色 4-红色 5-紫色 6-黄色 7-白色 8-灰色 9-淡蓝色\n");
    int i = judge(0,9);
    system("cls");
    if (i<0){system("cls");Rgrade(); getch();system("cls");setting();}
    printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                  请输入字体颜色                        ||\n"
            "\t||                  0.淡绿色                              ||\n"
            "\t||                  1.淡浅绿色                            ||\n"
            "\t||                  2.淡红色                              ||\n"
            "\t||                  3.淡紫色                              ||\n"
            "\t||                  4.淡黄色                              ||\n"
            "\t||                  5.亮白色                              ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
    //printf("请输入字体颜色   0-淡绿色 1-淡浅绿色 2-淡红色 3-淡紫色 4-淡黄色 5-亮白色\n");
    int j = judge(0,5);
    if (j<0){system("cls");Rgrade(); getch();system("cls");setting();}
    back = j*10+i;
    FILE *fb,*fp;
     if((fb = fopen("id.dat","w+"))==NULL)
    {
        printf("打开文件错误\n");
        exit (0);
    }

        fprintf(fb,"%d\n",num);
        fprintf(fb,"%s\n",password);
        fprintf(fb,"%d\n",back);
        fclose(fb);
        if((fp=fopen("guest.dat","rb+"))==NULL)
        {
            printf("\ncan not open this file7\n");
            exit(0);
        }
        set_back(back);system("cls");Rsucceed(); getch();system("cls");setting();
}

//////////////////////////////////////////////////////////////////////
void gst_menu()
{
    int choice;
    system("cls");
    system("mode con cols=80 lines=25");
    printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                 欢迎使用客人信息管理系统               ||\n"
            "\t||      请选择                                            ||\n"
            "\t||      1 客房预订                                        ||\n"
            "\t||      2 取消预订                                        ||\n"
            "\t||      3 登记入住                                        ||\n"
            "\t||      4 退房                                            ||\n"
            "\t||      5 客人信息查询                                    ||\n"
            "\t||      6 返回上一级                                      ||\n"
            "\t||                                                        || \n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
            gotoxy(30,25);
    choice = getch();
    switch(choice)
    {
    case '1':
        system("cls");
        reserve_choose();
        break;
    case '2':
        system("cls");
        giveup_reserve();
        break;
    case '3':
        system("cls");
        check_in();
        break;
    case '4':
        system("cls");
        check_out();
        break;
    case '5':
        system("cls");
        show_gst_menu();
        break;
    case '6':
        system("cls");
        menus();
        break;
    default:
        system("cls");
        printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t||                  对不起！没有您要的选项                ||\n"
            "\t||                                                        ||\n"
            "\t||                      请按任意键返回                    ||\n"
            "\t||                                                        ||\n"
            "\t||                                                        ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
        getch();
        system("cls");
        gst_menu();
    }
}

void show_gst_menu()
{
    int choice;


    system("cls");
    system("mode con cols=80 lines=25");
    printf("\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t||                 欢迎使用客人信息管理系统               ||\n"
            "\t||      请选择                                            ||\n"
            "\t||      1 按照客人姓名查询                                ||\n"
            "\t||      2 按照客人身份证号查询                            ||\n"
            "\t||      3 按照房间号查询                                  ||\n"
            "\t||      4 按照日期查询                                    ||\n"
            "\t||      5 查看所有客人                                    ||\n"
            "\t||      6 返回上一级                                      ||\n"
            "\t************************************************************\n"
            "\t------------------------------------------------------------\n"
            "\t************************************************************\n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");
    choice = getch();

    switch(choice)
    {
    case '1':
        system("cls");
        show_gst_name();
        break;
    case '2':
        system("cls");
        show_gst_gid();
        break;
    case '3':
        system("cls");
        show_gst_rid();
        break;
    case '4':
        system("cls");
        show_gst_date();
        break;
    case '5':
        system("cls");
        show_gst_all();
        break;
    case '6':
        system("cls");
        gst_menu();
        break;
    default:
        system("cls");
        Rgrade();
        getch();
        system("cls");
        show_gst_menu();
    }
}
void Rgrade()
{
system("mode con cols=80 lines=25");
     printf("\n\n\n\n\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t    *    *     *     *     *    *    *     *     *     *    \n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t************************************************************\n"
            "\t *     *      *            对不起            *       *    *  \n"
            "\t    *      *     *        输入错误        *     *      *     \n"
            "\t *     * *         *   请按任意键返回   *          * *    *   \n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");}


 void Rgrade2()
{
system("mode con cols=80 lines=25");
     printf("\n\n\n\n\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t    *    *     *     *     *    *    *     *     *     *    \n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t************************************************************\n"
            "\t *     *      *             输入错误             *    *    * \n"
            "\t    *      *     *         按#键退出       *     *      *     \n"
            "\t *     * *         *     请按其他键返回   *          * *  *  \n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");}
void Rgrade3()
{
system("mode con cols=80 lines=25");
     printf("\n\n\n\n\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t    *    *     *     *     *    *    *     *     *     *    \n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t************************************************************\n"
            "\t *     *      *      输入错误或门牌号已被占用     *   *   * \n"
            "\t    *      *     *         按#键退出       *     *      *     \n"
            "\t *     * *         *     请按其他键返回   *        * *    *  \n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");}


void Rsucceed()
{
    system("mode con cols=80 lines=25");
     printf("\n\n\n\n\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t    *    *     *     *     *    *    *     *     *     *    \n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t************************************************************\n"
            "\t *     *      *            恭喜您            *       *    *  \n"
            "\t    *      *     *        修改成功        *     *      *     \n"
            "\t *     * *         *   请按任意键返回   *          * *    *   \n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");}
void Rpass()
{
system("mode con cols=80 lines=25");
     printf("\n\n\n\n\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t    *    *     *     *     *    *    *     *     *     *    \n"
            "\t *     *    *     *    *     *    *     *     *     *     *\n"
            "\t************************************************************\n"
            "\t *     *      *            对不起            *       *    *  \n"
            "\t    *      *     *        密码错误        *     *      *     \n"
            "\t *     * *         *   请按任意键返回   *          * *    *   \n"
            "\t************************************************************\n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t    *    *     *     *     *    *    *    *     *     *    \n"
            "\t *     *    *     *    *     *    *     *    *     *     *\n"
            "\t************************************************************\n");}

